Revit 2027 API
DocumentSaveToLocalProgressChangedEventArgs.BeforeSaveToCentral Property
 True if the "save to local" operation is occurring before "save to central"; false if after.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool BeforeSaveToCentral { get; }
Public ReadOnly Property BeforeSaveToCentral As Boolean
	Get
public:
property bool BeforeSaveToCentral {
	bool get ();
}
member BeforeSaveToCentral : bool with get
Property Value
Boolean
See Also
Reference
DocumentSaveToLocalProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace